Revit 2027 API
FabricationConfiguration.StiffenerExists Method
 Checks to see if the specified stiffener exists in the fabrication database.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool StiffenerExists(
	int stiffenerId
)
Public Function StiffenerExists (
	stiffenerId As Integer
) As Boolean
public:
bool StiffenerExists(
	int stiffenerId
)
member StiffenerExists :
        stiffenerId : int -> bool
Parameters
stiffenerId Int32
 The stiffener identifier to check.
Return Value
Boolean
 Returns true if the stiffener exists.
See Also
Reference
FabricationConfiguration Class
Autodesk.Revit.DB Namespace